---
title: SchedulableField
classe: Autodesk.Revit.DB.SchedulableField
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# SchedulableField

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ScheduleFieldType FieldType { get; set; }` | `schedulableField.FieldType` | ScheduleFieldType |
| `Boolean IsValidObject { get; }` | `schedulableField.IsValidObject` | Boolean |
| `ElementId ParameterId { get; set; }` | `schedulableField.ParameterId` | ElementId |
| `Void Dispose()` | `schedulableField.Dispose()` | Void |
| `CustomFieldData GetCustomFieldData()` | `schedulableField.GetCustomFieldData()` | CustomFieldData |
| `String GetName(Document)` | `schedulableField.GetName(document)` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```